app/controllers/preferences_controller.rb

  def find_site
    @site = Site.find_by_id(params[:site_id])
---
SELECT * FROM `sites` WHERE (`sites`.`id` = '10') LIMIT 1

  def new
    created = Preference.find(:first, :conditions => { :site_id => @site.id, :user_id => current_user.id})
---
SELECT * FROM `preferences` WHERE (`preferences`.`user_id` = 2 AND `preferences`.`site_id` = 10) LIMIT 1

  def create
    #@preference = Preference.new(params[:preference])
    preference = params[:preference]
    preference[:twitter_only] = preference[:twitter_only] == "on" ? true : false
    preference[:twitter_self] = preference[:twitter_self] == "on" ? true : false
    preference[:twitter_all] = preference[:twitter_all] == "on" ? true : false
    created = Preference.find(:first, :conditions => { :site_id => preference[:site_id], :user_id => current_user.id })
    @preference = Preference.new(preference.merge({:user_id => current_user.id})) unless created
    @preference = created unless created.nil?
    @preference.attributes = preference.merge({:user_id => current_user.id})

    respond_to do |format|
      if @preference.save
---
SELECT * FROM `preferences` WHERE (`preferences`.`user_id` = 2 AND `preferences`.`site_id` = '10') LIMIT 1
INSERT INTO `preferences` (`throttle`, `created_at`, `twitter_all`, `updated_at`, `twitter_self`, `user_id`, `twitter_only`, `site_id`, `keywords`) VALUES(30, '2009-02-25 16:54:37', 0, '2009-02-25 16:54:37', 0, 2, 0, 10, 'fingy')