app/controllers/sites_controller.rb

  def show
    @site = Site.find(params[:id])
---
SELECT * FROM `sites` WHERE (`sites`.`id` = 2)

  def create
    @site = Site.find_by_name(params[:site][:name])
    unless @site
      @site = Site.new(params[:site])
    end
    respond_to do |format|
      if @site.save
---
SELECT `sites`.id FROM `sites` WHERE (`sites`.`name` = BINARY '') LIMIT 1
INSERT INTO `sites` (`name`, `created_at`, `updated_at`) VALUES('', '2009-02-20 19:50:31', '2009-02-20 19:50:31')