app/controllers/twitter_configs_controller.rb

  def create
    #@twitter_config = TwitterConfig.new(params[:twitter_config])
    twitter_config = params[:twitter_config]
    created = current_user.twitter_config
    @twitter_config = TwitterConfig.new(twitter_config.merge({:user_id => current_user.id})) unless created
    @twitter_config = created unless created.nil?
    @twitter_config.attributes = twitter_config.merge({:user_id => current_user.id})

    respond_to do |format|
      if @twitter_config.save
---
INSERT INTO `twitter_configs` (`twitter_password`, `created_at`, `twitter_username`, `updated_at`, `user_id`) VALUES('romans825', '2009-02-25 17:52:22', 'bikokid', '2009-02-25 17:52:22', 2)