app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    #@user.register! if @user && @user.valid?
    success = @user && @user.valid?
    if success && @user.errors.empty? && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `deleted_at`, `activation_code`, `remember_token`, `login`, `email`, `state`) VALUES('', '6ad3be55045a014259c1cb0431056d13431fc3de', '2009-02-20 01:11:02', NULL, 'ef96b77419e02fe34114023a04f3acd226831310', NULL, '2009-02-20 01:11:02', NULL, NULL, NULL, 'for', 'blah@baslh.com', 'passive')